In [ ]:
#Data.csv

**Step 1: Importing the libraries**

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
%matplotlib inline

**Step 2: Importing dataset**

In [35]:
data = pd.read_csv("Data.csv")
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

**Step 3: Handling the missing data**

In [36]:
print(data.isnull().sum())

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [37]:
median=data.Age.median()
data["Age"]= data["Age"].fillna(median)
print(data.isnull().sum())

Country      0
Age          0
Salary       1
Purchased    0
dtype: int64

In [38]:
median=data.Salary.median()
data["Salary"]= data["Salary"].fillna(median)
print(data.isnull().sum())

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

**Step 4: Encoding categorical data**

In [39]:
data.Purchased.unique()
data["Purchased"] = data["Purchased"].map({'Yes':1, 'No':0})
data.head()

   Country   Age   Salary  Purchased
0   France  44.0  72000.0          0
1    Spain  27.0  48000.0          1
2  Germany  30.0  54000.0          0
3    Spain  38.0  61000.0          0
4  Germany  40.0  61000.0          1

[link text](https://)**Step 5: Creating a dummy variable**

In [41]:
dummy = pd.get_dummies(data,drop_first= True)
dummy.head()

    Age   Salary  Purchased  Country_Germany  Country_Spain
0  44.0  72000.0          0                0              0
1  27.0  48000.0          1                0              1
2  30.0  54000.0          0                1              0
3  38.0  61000.0          0                0              1
4  40.0  61000.0          1                1              0

**Step 6: Splitting the datasets into training sets and Test sets**

In [47]:
x =data[["Age","Salary"]]
y = data["Purchased"]
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=0)

**Step 7: Feature Scaling**

In [49]:
from sklearn.preprocessing import StandardScaler
scale=StandardScaler()
x_train=scale.fit_transform(x_train)
x_test=scale.transform(x_test)